app/controllers/articles_controller.rb

SELECT  "users".* FROM "users"  ORDER BY "users"."id" DESC LIMIT 1
INSERT INTO "articles" ("title", "description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Testing debugger"], ["description", "Does it work???????????????"], ["user_id", 9], ["created_at", "2016-07-25 11:43:14.556075"], ["updated_at", "2016-07-25 11:43:14.556075"]]
---
	def create
		@article = Article.new(article_params)
		@article.user = User.last
		if @article.save